# Fabric Sheet Is Not Bent Method

Source: https://www.revitapidocs.com/2026/32e650c7-8da2-f519-a238-dfed1cfa323f.htm

---

| Fabric Sheet Is Not Bent Method |
| --- |

Method to verify that a fabric sheet is flat.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool IsNotBent()
```

```
Public Function IsNotBent As Boolean
```

```
public:
bool IsNotBent()
```

```
member IsNotBent : unit -> bool
```

#### Return Value

Boolean
True for flat fabric sheet, false for bent fabric sheet. See Also

#### Reference

FabricSheet Class Autodesk.Revit.DB.Structure Namespace